[
    {
        "index":1, "nombre": "Consola Playstation 5", "descripcion": "Experimenta una velocidad sorprendente de carga con una inmersión más intensa gracias a la SSD de ultra alta velocidad, compatible con retrolimentación háptica, gatillos adaptables y audio 3D, y una generación totalmente nueva de increíbles juegos de PlayStation®. Velocidad sorprendente: Disfruta de la potencia de una CPU, una GPU y una SSD personalizadas con E/S integradas que redefinirán lo que una consola PlayStation® puede hacer. Inmersión impresionante: Descubre una experiencia de juego más inmersiva con soporte para retroalimentación háptica, gatillos adaptables y tecnología de audio en 3D. Juegos asombrosos: Maravíllate con asombrosos gráficos y descubre las nuevas funciones de PS5™.", "imagen": "https://m.media-amazon.com/images/I/61BEpu+HTAL._SL1500_.jpg", "precio": "$350.000", "stock": 10, "categoriaId": "playstation", "categoria": "Playstation", "color": "blanco"
    },
    {
        "index":2, "nombre": "Joystick Playstation 5", "descripcion": "Control PS5 Dualsense: El control inalámbrico DualSense para PS5 ofrece respuesta háptica inmersiva, gatillos adaptativos dinámicos y un micrófono integrado, todo en un diseño icónico. Toma el control con un diseño avanzado de dos tonos que combina un diseño icónico e intuitivo con joysticks mejorados y una nueva barra luminosa. El control inalámbrico DualSense mantiene muchas características de DUALSHOCK®4, que vuelven para una nueva generación de juego.", "imagen": "https://m.media-amazon.com/images/I/612bjwBuobS._SL1500_.jpg", "precio": "$35.000", "stock": 10, "categoriaId": "playstation", "categoria": "Playstation", "color": "blanco"
    },
    {
        "index":3, "nombre": "Consola Playstation 4", "descripcion": "Con tu consola PlayStation 4 tendrás entretenimiento asegurado todos los días. Su tecnología fue creada para poner nuevos retos tanto a jugadores principiantes como expertos. Con la consola PlayStation 4, líder mundial en ventas durante años, podrás gozar de horas de juego y una excelente navegabilidad para disfrutar de películas, series y contenido online. Gracias a sus pequeñas dimensiones, su consumo energético es reducido, lo que la convierte en un producto económico y accesible. No solo esto, el control DualShock combina funciones revolucionarias y sin precedentes mientras conserva precisión, comodidad y exactitud en cada movimiento. Adaptada a tus necesidades: Guardá tus apps, fotos, videos y mucho más en el disco duro, que cuenta con una capacidad de 1 TB. Al contar con un procesador de 8 núcleos y uno gráfico, brinda una experiencia dinámica, respuestas ágiles, y transiciones fluidas de imágenes en alta definición. Por otro lado, tiene puerto USB y salida HDMI, que permiten conectar accesorios y cargar la batería de tu control mientras jugás. Vas a poder reproducir música, ver tus películas y series favoritas a través de las aplicaciones descargables.", "imagen": "https://m.media-amazon.com/images/I/51OnenSqevL._SL1000_.jpg", "precio": "$200.000", "stock": 10, "categoriaId": "playstation", "categoria": "Playstation", "color": "negro"
    },
    {
        "index":4, "nombre": "Joystick Playstation 4", "descripcion": "Control preciso: Este mando combina funciones revolucionarias mientras conserva precisión, comodidad y exactitud en cada movimiento. Gracias a su ergonomía especialmente pensada para la posición de tu mano, podés pasar horas jugando con total confort. Mayor comodidad y realismo: Te permite jugar sin necesidad de que haya cables de por medio. Está pensado no solamente para controlar mejor tus videojuegos, sino también para aumentar su realismo y experiencia. Activá el Bluetooth: Cuenta con conexión Bluetooth de alta tecnología para usarlo en cualquier ordenador o dispositivo; ya no necesitarás de aplicaciones de terceros ni cable USB. Además, posee gran capacidad antiinterferente, fácil manejo y señal de conexión estable.", "imagen": "https://m.media-amazon.com/images/I/61IG46p-yHL._SL1500_.jpg", "precio": "$15.000", "stock": 10, "categoriaId": "playstation", "categoria": "Playstation", "color": "negro"},
    {
        "index":5, "nombre": "Consola Xbox Series X", "descripcion": "Con tu consola Xbox Series tendrás entretenimiento asegurado todos los días. Su tecnología fue creada para poner nuevos retos tanto a jugadores principiantes como expertos. La nueva generación de consolas está comandada por la Xbox Series que llegó al mercado para sorprender a todos. Su potencia y alto rendimiento te permitirá reducir las horas de descarga de juegos y contenido de manera considerable en comparación con otras consolas. Además, vas a poder jugar durante horas mientras te divertís con jugadores de todo el mundo. Adaptada a tus necesidades: Guardá tus apps, fotos, videos y mucho más en el disco duro, que cuenta con una capacidad de 1 TB. Al contar con un procesador de 8 núcleos y uno gráfico, brinda una experiencia dinámica, respuestas ágiles, y transiciones fluidas de imágenes en alta definición. Por otro lado, tiene puerto USB y salida HDMI, que permiten conectar accesorios y cargar la batería de tu control mientras jugás. Vas a poder reproducir música, ver tus películas y series favoritas a través de las aplicaciones descargables.", "imagen": "https://m.media-amazon.com/images/I/61JGKhqxHxL._SL1500_.jpg", "precio": "$350.000", "stock": 10, "categoria": "Xbox", "categoriaId": "xbox", "color": "negro"
    },
    {
        "index":6, "nombre": "Joystick Xbox Series X", "descripcion": "Control preciso: Este mando combina funciones revolucionarias mientras conserva precisión, comodidad y exactitud en cada movimiento. Gracias a su ergonomía especialmente pensada para la posición de tu mano, podés pasar horas jugando con total confort. Mayor comodidad y realismo: Te permite jugar sin necesidad de que haya cables de por medio. Está pensado no solamente para controlar mejor tus videojuegos, sino también para aumentar su realismo y experiencia. Activá el Bluetooth: Cuenta con conexión Bluetooth de alta tecnología para usarlo en cualquier ordenador o dispositivo; ya no necesitarás de aplicaciones de terceros ni cable USB. Además, posee gran capacidad antiinterferente, fácil manejo y señal de conexión estable.", "imagen": "https://m.media-amazon.com/images/I/61X3uV04ztL._SL1500_.jpg", "precio": "$35.000", "stock": 10, "categoria": "Xbox", "categoriaId": "xbox", "color": "negro"
    },
    {
        "index":7, "nombre": "Consola Nintendo Switch", "descripcion": "Compra la consola que te permite disfrutar de tus juegos favoritos donde quieras y como quieras. Este paquete incluye la consola Nintendo Switch, la base de Nintendo Switch de color negro y los controles Joy-Con izquierdo y derecho de color azul y rojo respectivamente. También incluye todo lo que necesitas para empezar. Número de modelo: HAC-001(-01) (el número de serie del producto empieza con “XKW”) Este modelo incluye una batería que dura aproximadamente 4.5 a 9 horas*. *La duración de la batería varía dependiendo del juego. Por ejemplo, el juego The Legend of Zelda™: Breath of the Wild se puede usar por alrededor de 5.5 horas.", "imagen": "https://m.media-amazon.com/images/I/61zf9ciI0ML._AC_SL1500_.jpg", "precio": "$250.000", "stock": 10, "categoria": "Nintendo", "categoriaId": "nintendo", "color": "negro"
    },
    {
        "index":8, "nombre": "Consola Nintendo Switch OLED", "descripcion": "Con controles Joy-Con de color blanco, consola de color negro y una base de color blanco. Juega en casa en tu televisor o en el camino con una vibrante pantalla OLED de 7 pulgadas (17.78 cm) con la consola Nintendo Switch. Modelo OLED. Además de la pantalla, que ofrece colores brillantes y contrastes definidos, la consola Nintendo Switch. Modelo OLED incluye 64 GB de almacenamiento interno, una base con un puerto LAN para conexión por cable para jugar en el televisor, un soporte ajustable y amplio y audio mejorado.","imagen": "https://m.media-amazon.com/images/I/51yJ+OqktYL.jpg", "precio": "$330.000", "stock": 10, "categoria": "Nintendo", "categoriaId": "nintendo", "color": "blanco"
    },
    {
        "index":9, "nombre": "Joycon Nintendo Switch", "descripcion": "Adquiere un set adicional (o dos) de Joy-Con, los controles que hacen posible nuevas maneras de jugar.", "imagen": "https://m.media-amazon.com/images/I/41LA4roTiNL.jpg", "precio": "$20.000", "stock": 10, "categoria": "Nintendo", "categoriaId": "nintendo", "color": "rojo y azul"
    },
    {
        "index":10, "nombre": "Joystick Gamecube Nintendo Switch", "descripcion": "Mayor comodidad y realismo: Te permite jugar sin necesidad de que haya cables de por medio. Está pensado no solamente para controlar mejor tus videojuegos, sino también para aumentar su realismo y experiencia. Activá el Bluetooth: Cuenta con conexión Bluetooth de alta tecnología para usarlo en cualquier ordenador o dispositivo; ya no necesitarás de aplicaciones de terceros ni cable USB. Además, posee gran capacidad antiinterferente, fácil manejo y señal de conexión estable.", "imagen": "https://m.media-amazon.com/images/I/81FCOPif9qL._SL1500_.jpg", "precio": "$30.000", "stock": 10, "categoria": "Nintendo", "categoriaId": "nintendo", "color": "violeta"
    },
    {
        "index":11, "nombre": "Joystick PRO Nintendo Switch", "descripcion": "Lleva tus sesiones de juego a un nuevo nivel con el control Pro. Incluye control por movimiento, vibración HD, funcionalidad amiibo preinstalada y más.", "imagen": "https://m.media-amazon.com/images/I/7166--AaJIL._SL1500_.jpg", "precio": "$35.000", "stock": 10, "categoria": "Nintendo", "categoriaId": "nintendo", "color": "negro"
    },
    {
        "index":12, "nombre": "Consola Steam Deck", "descripcion": "Con tu consola Steam Deck tendrás entretenimiento asegurado todos los días. Su tecnología fue creada para poner nuevos retos tanto a jugadores principiantes como expertos. Adaptada a tus necesidades: Guardá tus apps, fotos, videos y mucho más en el disco duro, que cuenta con una capacidad de 64 GB. Al contar con un procesador de 4 núcleos y uno gráfico, brinda una experiencia dinámica, respuestas ágiles, y transiciones fluidas de imágenes en alta definición. Vas a poder reproducir música, ver tus películas y series favoritas a través de las aplicaciones descargables.", "imagen": "https://m.media-amazon.com/images/I/51TilHnyNIL._SL1200_.jpg", "precio": "$265.000", "stock": 10, "categoria": "Steam", "categoriaId": "steam", "color": "negro"
    }
]